Revit 2027 API
RoutingPreferenceManager.OwnerId Property
 The Id of the MEPCurveType that owns the RoutingPreferenceManager
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId OwnerId { get; }
Public ReadOnly Property OwnerId As ElementId
	Get
public:
property ElementId^ OwnerId {
	ElementId^ get ();
}
member OwnerId : ElementId with get
Property Value
ElementId
See Also
Reference
RoutingPreferenceManager Class
Autodesk.Revit.DB Namespace